benchmarks/results/k6-200.log

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: /Users/guerqian77/Documents/Codex/2026-09-21/new-chat/outputs/labops-erp/benchmarks/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 200 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 200 VUs  00.2s/30s

running (0m02.0s), 200/200 VUs, 29 complete and 0 interrupted iterations
default   [   4% ] 200 VUs  01.2s/30s

running (0m03.0s), 200/200 VUs, 53 complete and 0 interrupted iterations
default   [   7% ] 200 VUs  02.2s/30s

running (0m04.0s), 200/200 VUs, 84 complete and 0 interrupted iterations
default   [  11% ] 200 VUs  03.2s/30s

running (0m05.0s), 200/200 VUs, 111 complete and 0 interrupted iterations
default   [  14% ] 200 VUs  04.2s/30s

running (0m06.0s), 200/200 VUs, 130 complete and 0 interrupted iterations
default   [  17% ] 200 VUs  05.2s/30s

running (0m07.0s), 200/200 VUs, 152 complete and 0 interrupted iterations
default   [  21% ] 200 VUs  06.2s/30s

running (0m08.0s), 200/200 VUs, 181 complete and 0 interrupted iterations
default   [  24% ] 200 VUs  07.2s/30s

running (0m09.0s), 200/200 VUs, 213 complete and 0 interrupted iterations
default   [  27% ] 200 VUs  08.2s/30s

running (0m10.0s), 200/200 VUs, 244 complete and 0 interrupted iterations
default   [  31% ] 200 VUs  09.2s/30s

running (0m11.0s), 200/200 VUs, 281 complete and 0 interrupted iterations
default   [  34% ] 200 VUs  10.2s/30s

running (0m12.0s), 200/200 VUs, 310 complete and 0 interrupted iterations
default   [  37% ] 200 VUs  11.2s/30s

running (0m13.0s), 200/200 VUs, 334 complete and 0 interrupted iterations
default   [  41% ] 200 VUs  12.2s/30s

running (0m14.0s), 200/200 VUs, 360 complete and 0 interrupted iterations
default   [  44% ] 200 VUs  13.2s/30s

running (0m15.0s), 200/200 VUs, 390 complete and 0 interrupted iterations
default   [  47% ] 200 VUs  14.2s/30s

running (0m16.0s), 200/200 VUs, 421 complete and 0 interrupted iterations
default   [  51% ] 200 VUs  15.2s/30s

running (0m17.0s), 200/200 VUs, 450 complete and 0 interrupted iterations
default   [  54% ] 200 VUs  16.2s/30s

running (0m18.0s), 200/200 VUs, 481 complete and 0 interrupted iterations
default   [  57% ] 200 VUs  17.2s/30s

running (0m19.0s), 200/200 VUs, 509 complete and 0 interrupted iterations
default   [  61% ] 200 VUs  18.2s/30s

running (0m20.0s), 200/200 VUs, 538 complete and 0 interrupted iterations
default   [  64% ] 200 VUs  19.2s/30s

running (0m21.0s), 200/200 VUs, 559 complete and 0 interrupted iterations
default   [  67% ] 200 VUs  20.2s/30s

running (0m22.0s), 200/200 VUs, 582 complete and 0 interrupted iterations
default   [  71% ] 200 VUs  21.2s/30s

running (0m23.0s), 200/200 VUs, 616 complete and 0 interrupted iterations
default   [  74% ] 200 VUs  22.2s/30s

running (0m24.0s), 200/200 VUs, 649 complete and 0 interrupted iterations
default   [  77% ] 200 VUs  23.2s/30s

running (0m25.0s), 200/200 VUs, 678 complete and 0 interrupted iterations
default   [  81% ] 200 VUs  24.2s/30s

running (0m26.0s), 200/200 VUs, 710 complete and 0 interrupted iterations
default   [  84% ] 200 VUs  25.2s/30s

running (0m27.0s), 200/200 VUs, 745 complete and 0 interrupted iterations
default   [  87% ] 200 VUs  26.2s/30s

running (0m28.0s), 200/200 VUs, 781 complete and 0 interrupted iterations
default   [  91% ] 200 VUs  27.2s/30s

running (0m29.0s), 200/200 VUs, 811 complete and 0 interrupted iterations
default   [  94% ] 200 VUs  28.2s/30s

running (0m30.0s), 200/200 VUs, 841 complete and 0 interrupted iterations
default   [  97% ] 200 VUs  29.2s/30s

running (0m31.0s), 194/200 VUs, 865 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s

running (0m32.0s), 168/200 VUs, 891 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s

running (0m33.0s), 135/200 VUs, 924 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s

running (0m34.0s), 108/200 VUs, 951 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s

running (0m35.0s), 078/200 VUs, 981 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s

running (0m36.0s), 063/200 VUs, 996 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s

running (0m37.0s), 047/200 VUs, 1012 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s

running (0m38.0s), 034/200 VUs, 1025 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s

running (0m39.0s), 012/200 VUs, 1047 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s


  █ THRESHOLDS

    business_failures
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 1316    33.582171/s
    checks_succeeded...: 100.00% 1316 out of 1316
    checks_failed......: 0.00%   0 out of 1316

    ✓ inventory ok
    ✓ POST request accepted
    ✓ POST receipt accepted
    ✓ POST issue accepted
    ✓ reports ok
    ✓ POST submit accepted
    ✓ POST receipt posting accepted
    ✓ POST approval accepted

    CUSTOM
    business_failures..............: 0.00%  0 out of 1316

    HTTP
    http_req_duration..............: avg=5.07s p(50)=3.92s p(95)=8.06s  p(99)=8.53s  max=8.84s
      { expected_response:true }...: avg=5.07s p(50)=3.92s p(95)=8.06s  p(99)=8.53s  max=8.84s
    http_req_failed................: 0.00%  0 out of 1324
    http_reqs......................: 1324   33.786318/s

    EXECUTION
    iteration_duration.............: avg=6.39s p(50)=6.82s p(95)=15.31s p(99)=22.77s max=23.27s
    iterations.....................: 1059   27.023951/s
    vus............................: 12     min=12        max=200
    vus_max........................: 200    min=200       max=200

    NETWORK
    data_received..................: 7.9 MB 201 kB/s
    data_sent......................: 498 kB 13 kB/s



running (0m39.2s), 000/200 VUs, 1059 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  30s