benchmarks/results/k6-50.log

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: /Users/guerqian77/Documents/Codex/2026-09-21/new-chat/outputs/labops-erp/benchmarks/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 6 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  00.3s/30s

running (0m02.0s), 50/50 VUs, 40 complete and 0 interrupted iterations
default   [   4% ] 50 VUs  01.3s/30s

running (0m03.0s), 50/50 VUs, 66 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  02.3s/30s

running (0m04.0s), 50/50 VUs, 94 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  03.3s/30s

running (0m05.0s), 50/50 VUs, 119 complete and 0 interrupted iterations
default   [  14% ] 50 VUs  04.3s/30s

running (0m06.0s), 50/50 VUs, 160 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  05.3s/30s

running (0m07.0s), 50/50 VUs, 197 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  06.3s/30s

running (0m08.0s), 50/50 VUs, 233 complete and 0 interrupted iterations
default   [  24% ] 50 VUs  07.3s/30s

running (0m09.0s), 50/50 VUs, 269 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  08.3s/30s

running (0m10.0s), 50/50 VUs, 307 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  09.3s/30s

running (0m11.0s), 50/50 VUs, 339 complete and 0 interrupted iterations
default   [  34% ] 50 VUs  10.3s/30s

running (0m12.0s), 50/50 VUs, 374 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  11.3s/30s

running (0m13.0s), 50/50 VUs, 407 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  12.3s/30s

running (0m14.0s), 50/50 VUs, 438 complete and 0 interrupted iterations
default   [  44% ] 50 VUs  13.3s/30s

running (0m15.0s), 50/50 VUs, 470 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  14.3s/30s

running (0m16.0s), 50/50 VUs, 504 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  15.3s/30s

running (0m17.0s), 50/50 VUs, 534 complete and 0 interrupted iterations
default   [  54% ] 50 VUs  16.3s/30s

running (0m18.0s), 50/50 VUs, 562 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  17.3s/30s

running (0m19.0s), 50/50 VUs, 598 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  18.3s/30s

running (0m20.0s), 50/50 VUs, 629 complete and 0 interrupted iterations
default   [  64% ] 50 VUs  19.3s/30s

running (0m21.0s), 50/50 VUs, 659 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  20.3s/30s

running (0m22.0s), 50/50 VUs, 691 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  21.3s/30s

running (0m23.0s), 50/50 VUs, 718 complete and 0 interrupted iterations
default   [  74% ] 50 VUs  22.3s/30s

running (0m24.0s), 50/50 VUs, 737 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  23.3s/30s

running (0m25.0s), 50/50 VUs, 768 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  24.3s/30s

running (0m26.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  84% ] 50 VUs  25.3s/30s

running (0m27.0s), 50/50 VUs, 839 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  26.3s/30s

running (0m28.0s), 50/50 VUs, 881 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  27.3s/30s

running (0m29.0s), 50/50 VUs, 924 complete and 0 interrupted iterations
default   [  94% ] 50 VUs  28.3s/30s

running (0m30.0s), 50/50 VUs, 952 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  29.3s/30s

running (0m31.0s), 43/50 VUs, 982 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s

running (0m32.0s), 16/50 VUs, 1009 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s


  █ THRESHOLDS

    business_failures
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 1301    39.627533/s
    checks_succeeded...: 100.00% 1301 out of 1301
    checks_failed......: 0.00%   0 out of 1301

    ✓ inventory ok
    ✓ POST request accepted
    ✓ reports ok
    ✓ POST issue accepted
    ✓ POST receipt accepted
    ✓ POST receipt posting accepted
    ✓ POST submit accepted
    ✓ POST approval accepted

    CUSTOM
    business_failures..............: 0.00%  0 out of 1301

    HTTP
    http_req_duration..............: avg=1.14s p(50)=1.13s p(95)=1.92s p(99)=2.26s max=2.6s
      { expected_response:true }...: avg=1.14s p(50)=1.13s p(95)=1.92s p(99)=2.26s max=2.6s
    http_req_failed................: 0.00%  0 out of 1309
    http_reqs......................: 1309   39.871207/s

    EXECUTION
    iteration_duration.............: avg=1.51s p(50)=1.32s p(95)=3.7s  p(99)=4.89s max=5.5s
    iterations.....................: 1025   31.22077/s
    vus............................: 16     min=16        max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 7.3 MB 223 kB/s
    data_sent......................: 501 kB 15 kB/s



running (0m32.8s), 00/50 VUs, 1025 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s